# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mas' # Mac App Store manager

# Development
brew 'pnpm'
brew 'yarn'

# Apps
cask '1password'
cask 'cursor'
cask 'discord'
cask 'docker'
cask 'readdle-spark'
cask 'slack'
cask 'zoom'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709